app/Controllers/Auth.php

    public function autenticar()
    {
        $validation = \Config\Services::validation();

        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $model = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'nicoo.ivanoff@gmail.com'
 LIMIT 1