app/Controllers/Categorias.php

    public function index()
    {
        $categoriaModel = new CategoriaModel();

        $data = [
            'categorias' => $categoriaModel->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `categorias`
ORDER BY `id` DESC

    public function store()
    {
        $rules = [
            'nombre' => 'required|min_length[3]|max_length[120]|is_unique[categorias.nombre]',
            'descripcion' => 'permit_empty|max_length[1000]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $categoriaModel = new CategoriaModel();

        $categoriaModel->save([
            'nombre'      => trim($this->request->getPost('nombre')),
            'descripcion' => trim((string) $this->request->getPost('descripcion')),
            'created_at'  => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `categorias` (`nombre`, `descripcion`, `created_at`) VALUES ('Alimento de gato adulto Urinario', 'Categoria para Alimentos de gatos Adultos con problemas urinarios', '2026-04-14 22:24:18')