app/Controllers/Clientes.php

    public function index()
    {
        $clienteModel = new ClienteModel();

        $clientes = $clienteModel
            ->orderBy('id', 'DESC')
            ->findAll();
---
SELECT *
FROM `clientes`
ORDER BY `id` DESC

    public function store()
    {
        $rules = [
            'nombre'      => 'required|min_length[3]|max_length[150]',
            'telefono'    => 'permit_empty|max_length[50]',
            'direccion'   => 'permit_empty|max_length[255]',
            'localidad'   => 'permit_empty|max_length[120]',
            'observacion' => 'permit_empty|max_length[2000]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $clienteModel = new ClienteModel();

        $clienteModel->save([
            'nombre'      => trim($this->request->getPost('nombre')),
            'telefono'    => trim((string) $this->request->getPost('telefono')),
            'direccion'   => trim((string) $this->request->getPost('direccion')),
            'localidad'   => trim((string) $this->request->getPost('localidad')),
            'observacion' => trim((string) $this->request->getPost('observacion')),
            'created_at'  => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `clientes` (`nombre`, `telefono`, `direccion`, `localidad`, `observacion`, `created_at`) VALUES ('luis astesiano/ la nena petshop', '3624158579', 'Av. España 800', 'Barranqueras', 'Petshop ubicado en un esquina', '2026-04-15 22:58:27')