app/Controllers/MovimientosStock.php

    public function index()
    {
        $movimientoModel = new MovimientoStockModel();

        $movimientos = $movimientoModel
            ->select('movimientos_stock.*, productos.nombre AS producto_nombre, productos.kilogramos, categorias.nombre AS categoria_nombre, usuarios.nombre AS usuario_nombre')
            ->join('productos', 'productos.id = movimientos_stock.producto_id')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->join('usuarios', 'usuarios.id = movimientos_stock.usuario_id')
            ->orderBy('movimientos_stock.id', 'DESC')
            ->findAll();
---
SELECT `movimientos_stock`.*, `productos`.`nombre` AS `producto_nombre`, `productos`.`kilogramos`, `categorias`.`nombre` AS `categoria_nombre`, `usuarios`.`nombre` AS `usuario_nombre`
FROM `movimientos_stock`
JOIN `productos` ON `productos`.`id` = `movimientos_stock`.`producto_id`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
JOIN `usuarios` ON `usuarios`.`id` = `movimientos_stock`.`usuario_id`
ORDER BY `movimientos_stock`.`id` DESC

    public function create()
    {
        $productoModel = new ProductoModel();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre AS categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.nombre', 'ASC')
            ->findAll();
---
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC

    public function store()
    {
        $rules = [
            'producto_id'       => 'required|is_not_unique[productos.id]',
            'tipo_movimiento'   => 'required|in_list[ingreso,egreso,ajuste]',
            'cantidad'          => 'required|integer|greater_than[0]',
            'motivo'            => 'permit_empty|max_length[150]',
            'observacion'       => 'permit_empty|max_length[2000]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $productoModel   = new ProductoModel();
        $movimientoModel = new MovimientoStockModel();

        $productoId      = (int) $this->request->getPost('producto_id');
        $tipoMovimiento  = $this->request->getPost('tipo_movimiento');
        $cantidad        = (int) $this->request->getPost('cantidad');
        $motivo          = trim((string) $this->request->getPost('motivo'));
        $observacion     = trim((string) $this->request->getPost('observacion'));

        $producto = $productoModel->find($productoId);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = 2

            'created_at'       => date('Y-m-d H:i:s'),
        ]);

        $productoModel->update($productoId, [
            'stock_unidades' => $nuevoStock,
        ]);
---
UPDATE `productos` SET `stock_unidades` = 220
WHERE `productos`.`id` IN (2)