app/Controllers/Pedidos.php

SELECT `id`, `nombre`
FROM `usuarios`
WHERE `rol` = 'vendedor'
ORDER BY `nombre` ASC
---
    $vendedores = [];
    if ($rol === 'admin') {
        $db = \Config\Database::connect();
        $vendedores = $db->table('usuarios')
            ->select('id, nombre')
            ->where('rol', 'vendedor')
            ->orderBy('nombre', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `clientes`
ORDER BY `nombre` ASC
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC
---
    public function create()
    {
        $clienteModel = new ClienteModel();
        $productoModel = new ProductoModel();

        $clientes = $clienteModel
            ->orderBy('nombre', 'ASC')
            ->findAll();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre AS categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.nombre', 'ASC')
            ->findAll();