app/Controllers/Pedidos.php

    public function index()
    {
        $pedidoModel = new PedidoModel();
        $rol = session('rol');
        $usuarioId = session('id_usuario');

        $builder = $pedidoModel
            ->select('pedidos.*, clientes.nombre AS cliente_nombre, usuarios.nombre AS vendedor_nombre')
            ->join('clientes', 'clientes.id = pedidos.cliente_id')
            ->join('usuarios', 'usuarios.id = pedidos.usuario_id')
            ->orderBy('pedidos.id', 'DESC');

        if ($rol === 'vendedor') {
            $builder->where('pedidos.usuario_id', $usuarioId);
        }

        $pedidos = $builder->findAll();
---
SELECT `pedidos`.*, `clientes`.`nombre` AS `cliente_nombre`, `usuarios`.`nombre` AS `vendedor_nombre`
FROM `pedidos`
JOIN `clientes` ON `clientes`.`id` = `pedidos`.`cliente_id`
JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
WHERE `pedidos`.`usuario_id` = '2'
ORDER BY `pedidos`.`id` DESC

    public function edit($id = null)
    {
        $pedidoModel = new PedidoModel();
        $pedidoDetalleModel = new PedidoDetalleModel();
        $clienteModel = new ClienteModel();
        $productoModel = new ProductoModel();

        $pedido = $pedidoModel->find($id);

        if (!$pedido) {
            return redirect()->to('/pedidos')->with('error', 'El pedido no existe.');
        }

        if (session('rol') === 'vendedor' && (int) $pedido['usuario_id'] !== (int) session('id_usuario')) {
            return redirect()->to('/pedidos')->with('error', 'No tienes permisos para editar este pedido.');
        }

        if ($pedido['estado'] === 'entregado') {
            return redirect()->to('/pedidos')->with('error', 'No se puede editar un pedido entregado.');
        }

        $detalles = $pedidoDetalleModel
            ->select('pedido_detalles.*, productos.nombre AS producto_nombre, productos.kilogramos, categorias.nombre AS categoria_nombre')
            ->join('productos', 'productos.id = pedido_detalles.producto_id')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->where('pedido_detalles.pedido_id', $id)
            ->findAll();

        $clientes = $clienteModel
            ->orderBy('nombre', 'ASC')
            ->findAll();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre AS categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.nombre', 'ASC')
            ->findAll();
---
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '1'
SELECT `pedido_detalles`.*, `productos`.`nombre` AS `producto_nombre`, `productos`.`kilogramos`, `categorias`.`nombre` AS `categoria_nombre`
FROM `pedido_detalles`
JOIN `productos` ON `productos`.`id` = `pedido_detalles`.`producto_id`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
WHERE `pedido_detalles`.`pedido_id` = '1'
SELECT *
FROM `clientes`
ORDER BY `nombre` ASC
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC