app/Controllers/PrecioProductos.php

    public function index()
    {
        $precioProductoModel = new PrecioProductoModel();

        $precios = $precioProductoModel
            ->select('precio_productos.*, productos.nombre AS producto_nombre, productos.kilogramos, categorias.nombre AS categoria_nombre')
            ->join('productos', 'productos.id = precio_productos.producto_id')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.nombre', 'ASC')
            ->orderBy('precio_productos.cantidad_desde', 'ASC')
            ->findAll();
---
SELECT `precio_productos`.*, `productos`.`nombre` AS `producto_nombre`, `productos`.`kilogramos`, `categorias`.`nombre` AS `categoria_nombre`
FROM `precio_productos`
JOIN `productos` ON `productos`.`id` = `precio_productos`.`producto_id`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC, `precio_productos`.`cantidad_desde` ASC

    public function create()
    {
        $productoModel = new ProductoModel();

        $productos = $productoModel
            ->select('productos.*, categorias.nombre AS categoria_nombre')
            ->join('categorias', 'categorias.id = productos.categoria_id')
            ->orderBy('productos.nombre', 'ASC')
            ->findAll();
---
SELECT `productos`.*, `categorias`.`nombre` AS `categoria_nombre`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
ORDER BY `productos`.`nombre` ASC