app/Controllers/Productos.php

SELECT *
FROM `categorias`
ORDER BY `nombre` ASC
---
    public function create()
    {
        $categoriaModel = new CategoriaModel();

        $data = [
            'categorias' => $categoriaModel->orderBy('nombre', 'ASC')->findAll(),
        ];

INSERT INTO `productos` (`categoria_id`, `nombre`, `tipo`, `kilogramos`, `bolsas_por_pallet`, `stock_unidades`, `created_at`) VALUES ('1', 'Crianza Perro', 'mordida normal', '15', '80', '80', '2026-04-20 00:20:57')
---
    public function store()
    {
        $rules = [
            'categoria_id'       => 'required|is_not_unique[categorias.id]',
            'nombre'             => 'required|min_length[2]|max_length[150]',
            'tipo'               => 'permit_empty|max_length[120]',
            'kilogramos'         => 'required|decimal',
            'bolsas_por_pallet'  => 'required|integer|greater_than_equal_to[0]',
            'stock_unidades'     => 'required|integer|greater_than_equal_to[0]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $productoModel = new ProductoModel();

        $productoModel->save([
            'categoria_id'       => $this->request->getPost('categoria_id'),
            'nombre'             => trim($this->request->getPost('nombre')),
            'tipo'               => trim((string) $this->request->getPost('tipo')),
            'kilogramos'         => $this->request->getPost('kilogramos'),
            'bolsas_por_pallet'  => $this->request->getPost('bolsas_por_pallet'),
            'stock_unidades'     => $this->request->getPost('stock_unidades'),
            'created_at'         => date('Y-m-d H:i:s'),
        ]);