app/Controllers/Usuarios.php

    public function index()
    {
        $usuarioModel = new UsuarioModel();

        $data = [
            'usuarios' => $usuarioModel->orderBy('id', 'DESC')->findAll()
        ];
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC